# ****************************************************************************
# Brewfile
# ****************************************************************************
#
# ============================================================================
# CLI Development Tools
# ============================================================================

brew "bat"           # Cat clone with syntax highlighting
brew "black"         # Python formatter
brew "eza"           # Modern ls replacement
brew "fd"            # Fast find alternative (needed for Telescope)
brew "ffmpeg"        # Multimedia framework
brew "fzf"           # Fuzzy finder
brew "git"           # Version control software
brew "go"            # Go programming language
brew "gopls"         # Go LSP server
brew "htop"          # Interactive process viewer
brew "iftop"         # Network bandwidth monitor
brew "jq"            # JSON processor
brew "llvm"          # C/C++ LSP (clangd) and tools
brew "lua-language-server" # Lua LSP server
brew "mas"           # Mac App Store CLI
brew "neofetch"      # System information tool
brew "neovim"        # Modern terminal editor
brew "node"          # Node.js
brew "openjdk"       # Java JDK
brew "pandoc"        # Document converter
brew "powerlevel10k" # Beautiful, fast zsh prompt theme
brew "pygments"      # Syntax highlighter (required for colorize plugin)
brew "pyright"       # Python LSP server
brew "ripgrep"       # Fast text search (rg)
brew "rsync"         # File synchronization
brew "rust-analyzer" # Rust LSP server
brew "stylua"        # Lua formatter
brew "tree"          # Directory tree viewer
brew "typst"         # Modern LaTeX alternative
brew "wget"          # Direct download tool
brew "xz"            # Archive utility
brew "yt-dlp"        # Video download utility
brew "zellij"        # Modern terminal multiplexer
brew "zig"           # Zig programming language
brew "zls"           # Zig LSP server

# ============================================================================
# Zsh Utilities
# ============================================================================

brew "atuin"                   # Magical shell history with search
brew "thefuck"                 # Corrects console command mistakes
brew "zoxide"                  # Smarter cd command (z)
brew "zsh-autosuggestions"     # Fish-like autosuggestions
brew "zsh-completions"         # Additional completion definitions
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh (red/green commands)

# ============================================================================
# GUI Applications
# ============================================================================

cask "aldente"       # Battery management
cask "anki"          # Spaced repetition
cask "bambu-studio"  # 3D printing software
cask "calibre"       # Ebook library
cask "claude"        # Claude AI desktop app
cask "claude-code"   # Claude Code CLI
cask "crossover"     # Windows app compatibility
cask "discord"       # VoIP client
cask "dotnet-sdk"    # .NET development
cask "espanso"       # Text expansion utility
cask "figma"         # UI/UX design
cask "firefox"       # Privacy-focused browser
cask "flux-app"      # Blue light filter
cask "ghostty"       # Modern GPU-accelerated terminal
cask "hammerspoon"   # Automation tool
cask "heroic"        # Epic/GOG/Amazon games launcher
cask "mactex"        # LaTeX distribution
cask "mamp"          # Full stack development suite for SAW
cask "obs"           # Screen recording
cask "obsidian"      # Note taking
cask "ollama-app"    # Local LLM runtime
cask "openemu"       # Retro game emulator
cask "openvpn-connect" # OpenVPN client
cask "prismlauncher" # Minecraft launcher
cask "pycharm"       # Python IDE
cask "signal"        # Privacy-focused messaging
cask "spotify"       # Music streaming
cask "steam"         # Gaming platform
cask "swish"         # Trackpad gestures for window management
cask "transmission"  # Torrent client
cask "visual-studio-code" # Code editor  
cask "wireshark-app" # Network analysis

# ============================================================================
# Mac App Store Applications
# ============================================================================

mas "ElMediaPlayer", id: 1044549675  # Video player
mas "Things", id: 904280696          # GTD task manager


# ============================================================================
# Fonts
# ============================================================================

cask "font-meslo-lg-nerd-font"  # MesloLGS Nerd Font (Powerline symbols, icons)
cask "font-noto-emoji"          # Google Noto Color Emoji font
